000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLOWORLD.
000300 AUTHOR. EMMA SKOVGAARD.
000400 ENVIRONMENT DIVISION.
000500 PROCEDURE DIVISION.
000600     DISPLAY 'HELLO WORLD'.
000700     STOP RUN.