000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. APP2.
000300 AUTHOR. EMMA SKOVGAARD.
000400 ENVIRONMENT DIVISION.
000500 PROCEDURE DIVISION.
000600 Begin.
000700     PERFORM DisplayTest 10 TIMES.
000800     STOP RUN.
000900 DisplayTest.
001000     DISPLAY "Test".
